Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестоимости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, кратное которому можно заказывать в 'Заказе поставщику'"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Содержит массу брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Comment>Код товарной номенклатуры внешнеэкономической деятельности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Comment>Ценовая группа номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подакцизный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЯчейкиХраненияПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЯчейкиХраненияПоУмолчанию</Name>
			<Comment>Ячейки хранения по умолчанию</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯчейкаХранения</Name>
					<Comment>Ячейка хранения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрайсЛистыКонтрагентовПравилаЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрайсЛистыКонтрагентовПравилаЗагрузки</Name>
			<Comment>Журнал правил загрузки прайс-листов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПравила</Name>
					<Comment>Вид правила</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизитаПрайсЛиста</Name>
					<Comment>Имя реквизита прайс-листа, подлежащего обработке по правилу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Присваиваемое реквизиту значение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокПрименения</Name>
					<Comment>Последовательность применения правил загрузки (В пределах “Объекта правила”)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОригинальное</Name>
					<Comment>Начальное значение реквизита до изменений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеПравила</Name>
					<Comment>Назначение правила загрузки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравилЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПравила</Name>
					<Comment>Строка производителя, производитель или ключ строки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Comment>Идентификатор правила</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимыКонтроляУникальностиНомераПоКаталогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РежимыКонтроляУникальностиНомераПоКаталогу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсейНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроизводителю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ObjectModule.bsl
// Модуль справочника Номенклатура

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик события объекта возникает в момент, когда выполняется установка нового номера.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Префикс              - Строка - Префикс, который будет использоваться для генерации номера.
//
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	// Вызываем общий обработчик события
	ПрефиксацияОбъектов.ПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоКода()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УнаследоватьОтРодителей();
	ПродолжатьЗаполнение = ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"СпособРаспределенияДопРасходов,СтатьяДопРасходов,ЭтоГруппа"
	);
	
	Если НЕ ПродолжатьЗаполнение Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоБазовомуКаталогу(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЭДО(ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		
		Справочники.Номенклатура.ТипНоменклатурыПриИзменении(ЭтотОбъект);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияПоУмолчанию();

КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	// Затираем артикул - все равно он будет новый
	Если НЕ ОбъектКопирования.ЭтоГруппа Тогда
		Артикул = "";
		АртикулДляПоиска = "";
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем ПроверятьУникальность;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим корректность заполнения количества для серийного товара
	Если НЕ ЭтоГруппа Тогда
		ОбработкаСобытийОбъектаСервер.ПроверитьКоличествоСерийнойНоменклатуры(ЭтотОбъект, Отказ);
		
		РежимКонтроля = Автосервис.РежимКонтроляУникальностиАртикула();
		Если Не РежимКонтроля = Перечисления.РежимыКонтроляУникальностиНомераПоКаталогу.НеКонтролировать Тогда
			
			Если РежимКонтроля = Перечисления.РежимыКонтроляУникальностиНомераПоКаталогу.ПоПроизводителю Тогда
			
				НайденнаяНоменклатура = Справочники.Номенклатура.НайтиНоменклатуру(
					ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(Артикул),
					Производитель,
					Ссылка
				);
				ТекстОшибки = НСтр("ru = 'Поле ""Артикул"" не уникально в пределах ""Производителя"" и ""Номенклатуры""'");
			Иначе
				
				НайденнаяНоменклатура = Справочники.Номенклатура.НайтиНоменклатуру(
					ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(Артикул),
					,
					Ссылка
				);
				ТекстОшибки = НСтр("ru = 'Поле ""Артикул"" не уникально в пределах ""Номенклатуры""'");
				
			КонецЕсли;
			
			// Информируем пользователя о найденной коллизии
			Если ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда
				
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , , Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ Справочники.Номенклатура.ПроверитьКорректностьСтавкиНДС(ЭтотОбъект) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Указана недействительная ставка НДС.'"), ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Выполняется заполнение поля "Артикул для поиска" даже в режиме загрузки
	Если НЕ ЭтоГруппа Тогда
		АртикулДляПоиска = ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(Артикул);
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем очистку лишних параметров номенклатуры
	Если НЕ (ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор 
		ИЛИ ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Комплект ИЛИ ЭтоГруппа) Тогда
		
		СоставНабора.Очистить();
		
	КонецЕсли;
	
	Если ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга И НЕ ЭтоГруппа Тогда
	
		СпособРаспределенияДопРасходов = Неопределено;
		СтатьяДопРасходов = Неопределено;
	
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СтароеЗначениеРодителя", Ссылка.Родитель);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый И НЕ ЭтоГруппа Тогда
		
		// Добавим номенклатуру в группы товаров оборудования
		ДобавитьВГруппыОборудования(ЭтотОбъект);
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(ОсновнаяЕдиницаИзмерения) Тогда
			
			ОсновнаяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Ссылка);
			Записать();
			
		КонецЕсли;
		
		Если НЕ Отказ И ЭтотОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга 
			И НЕ ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЯчейкиХраненияПоУмолчанию.СкладКомпании КАК СкладКомпании,
				|	ЯчейкиХраненияПоУмолчанию.Номенклатура КАК Номенклатура,
				|	ЯчейкиХраненияПоУмолчанию.ЯчейкаХранения КАК ЯчейкаХранения
				|ИЗ
				|	РегистрСведений.ЯчейкиХраненияПоУмолчанию КАК ЯчейкиХраненияПоУмолчанию
				|ГДЕ
				|	ЯчейкиХраненияПоУмолчанию.Номенклатура = &Номенклатура";
			Запрос.УстановитьПараметр("Номенклатура", Ссылка);
			
			УстановитьПривилегированныйРежим(Истина);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					МенеджерЗаписи = РегистрыСведений.ЯчейкиХраненияПоУмолчанию.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
					МенеджерЗаписи.Удалить();
					
				КонецЦикла;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ И ЭтотОбъект.ДополнительныеСвойства.Свойство("ПрайсЛист") Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Создание номенклатуры из прайс-листа'", 
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.Номенклатура,
			ЭтотОбъект.Ссылка,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Создана номенклатура <%1> из прайс-листа <%2>'"),
			ЭтотОбъект.Наименование, Строка(ЭтотОбъект.ДополнительныеСвойства.ПрайсЛист)));
	КонецЕсли;
		
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ПрайсЛист КАК ПрайсЛист,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.НазначениеПравила КАК НазначениеПравила,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ОбъектПравила КАК ОбъектПравила,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ИдентификаторПравила КАК ИдентификаторПравила
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПрайсЛистыКонтрагентовПравилаЗагрузки
	|ГДЕ
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.Значение = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ПрайсЛист,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.НазначениеПравила,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ОбъектПравила,
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ИдентификаторПравила
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки КАК ПрайсЛистыКонтрагентовПравилаЗагрузки
	|ГДЕ
	|	ПрайсЛистыКонтрагентовПравилаЗагрузки.ЗначениеОригинальное = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры // ПередУдалением()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает результат проверки на соответствие номенклатуры и режима заполнения группы товаров.
//
// Параметры
//  Номенклатура -  Объект           - Номенклатура, которая участвует в проверке на соответствие.
//  ГруппаТоваров - СправочникСсылка - Группа товаров оборудования.
//
Функция СоответствуетЗаполнениюГруппы(Номенклатура, ГруппаТоваров)
	
	Результат = Ложь;
	
	Если ГруппаТоваров.РежимЗаполнения = 0 Тогда 
		Результат = Истина; // Все товары
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 1 Тогда
		Результат = Номенклатура.ТипНоменклатуры.Весовой; // Весовой товар
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 2 Тогда
		Результат = НЕ Номенклатура.ТипНоменклатуры.Весовой; // Штучный товар
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 3 Тогда // Типы товара из списка
		Результат = (ГруппаТоваров.ОграниченияЗаполненияГруппы.Найти(
					Номенклатура.ТипНоменклатуры, "ТипГруппаНоменклатуры") <> Неопределено);		
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 4 Тогда // Товар в иерархии из списка
		Для Каждого СтрокаГруппа Из ГруппаТоваров.ОграниченияЗаполненияГруппы Цикл
			
			Результат = Номенклатура.ПринадлежитЭлементу(СтрокаГруппа.ТипГруппаНоменклатуры);
			
			Если Результат Тогда 
				Прервать; 
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СоответствуетЗаполнениюГруппы()

Процедура ДобавитьВГруппыОборудования(ВходнойОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокГрупп = Новый СписокЗначений;
	ГруппыТоваровВыборка = Справочники.ГруппыТоваровОборудования.Выбрать();
	
	Пока ГруппыТоваровВыборка.Следующий() Цикл
		
		Если СоответствуетЗаполнениюГруппы(ВходнойОбъект.Ссылка, ГруппыТоваровВыборка.Ссылка)
			И ГруппыТоваровВыборка.АвтоматическиЗаполнятьНовымТоваром Тогда
			
			СписокГрупп.Добавить(ГруппыТоваровВыборка.Ссылка);	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если (СписокГрупп.Количество() > 0) Тогда
		
		Для Каждого ГруппаТоваров Из СписокГрупп Цикл
			
			ЗаписьТоварыВОборудовании = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
			ЗаписьТоварыВОборудовании.ГруппаТоваров = ГруппаТоваров.Значение;
			ЗаписьТоварыВОборудовании.Номенклатура = ВходнойОбъект.Ссылка;
			ЗаписьТоварыВОборудовании.НомерЯчейки = 
						РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров.Значение) + 1;
			ЗаписьТоварыВОборудовании.МоментИзменения = ТекущаяДатаСеанса();
			ЗаписьТоварыВОборудовании.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьВГруппыОборудования()

Процедура УнаследоватьОтРодителей()
	
	Если ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РодительскаяГруппа = Родитель;
	
	Пока ЗначениеЗаполнено(РодительскаяГруппа) Цикл
		
		Если ЗначениеЗаполнено(СпособРаспределенияДопРасходов) И ЗначениеЗаполнено(СтатьяДопРасходов) Тогда
			Прервать;
		КонецЕсли;
		
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			РодительскаяГруппа,
			"СпособРаспределенияДопРасходов,СтатьяДопРасходов,Родитель"
		);
		
		РодительскаяГруппа = РеквизитыРодителя.Родитель;
		
		Если
			НЕ ЗначениеЗаполнено(СпособРаспределенияДопРасходов)
			И ЗначениеЗаполнено(РеквизитыРодителя.СпособРаспределенияДопРасходов)
		Тогда
			
			СпособРаспределенияДопРасходов = РеквизитыРодителя.СпособРаспределенияДопРасходов;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтатьяДопРасходов) И ЗначениеЗаполнено(РеквизитыРодителя.СтатьяДопРасходов) Тогда
			
			СтатьяДопРасходов = РеквизитыРодителя.СтатьяДопРасходов;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоБазовомуКаталогу(ДанныеЗаполнения)
	
	Если
		ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		ИЛИ НЕ ДанныеЗаполнения.Свойство("Артикул")
		ИЛИ НЕ ДанныеЗаполнения.Свойство("Производитель")
	Тогда
		Возврат;
	КонецЕсли;
	
	ПрайсЛист = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ПрайсЛист", Неопределено);
	ДанныеНоменклатуры = ПрайсЛистыКонтрагентов.СоздатьОбновитьНоменклатуру(
		ДанныеЗаполнения.Артикул,
		ДанныеЗаполнения.Производитель,
		ПрайсЛист
	);
	
	Если ДанныеНоменклатуры = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	Иначе
		БазовыйКаталог = ДанныеНоменклатуры.ПрайсЛист;
		ДанныеЗаполнения.Вставить("ПрайсЛист", БазовыйКаталог);
		ДополнительныеСвойства.Вставить("ПрайсЛист", БазовыйКаталог);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеНоменклатуры);
		Если ДанныеНоменклатуры.Свойство("Вес") Тогда
			КоэффициентПересчетаВесаПоУмолчанию = 1000;
			Если БазовыйКаталог.КоэффициентПересчетаВеса = КоэффициентПересчетаВесаПоУмолчанию Тогда
				Вес = ДанныеНоменклатуры.Вес;
			Иначе
				// TODO: Почему делим на 1000 если коэф. не равен 1000??
				Вес = Формат(Число(ДанныеНоменклатуры.Вес) / КоэффициентПересчетаВесаПоУмолчанию, "ЧЦ=15; ЧДЦ=3");
			КонецЕсли;
		КонецЕсли;
		Если НЕ БазовыйКаталог.Пустая() И Родитель.Пустая() Тогда
			Родитель = БазовыйКаталог.НоменклатурнаяГруппа;
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеПолное = Наименование;
	
	Если ПустаяСтрока(НаименованиеИностранное) Тогда
		НаименованиеИностранное = Наименование;
	КонецЕсли;
	
	Если СтранаПроисхождения.Пустая() Тогда
		СтранаПроисхождения = Производитель.СтранаПроисхождения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЭДО(ДанныеЗаполнения)
	
	Если 
		ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		ИЛИ НЕ ДанныеЗаполнения.Свойство("Источник")
		ИЛИ ВРег(ДанныеЗаполнения.Источник) <> "ЭДО"
	Тогда
	
		Возврат;
		
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если Не ЭтоГруппа Тогда
		
		АртикулДляПоиска = ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(Артикул);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Если ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		
		ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаУчета) Тогда
		
		ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		
		СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
		
		БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияКоличества.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
